<a href="https://colab.research.google.com/github/p-cuadros/curso_python/blob/master/s2lab1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
from numpy.random import rand

In [0]:
np.random.seed(101)

In [0]:
df = pd.DataFrame( rand(5,4), ["F1","F2","F3","F4","F5"],["C1","C2","C3","C4"])

In [0]:
df

          C1        C2        C3        C4
F1  0.685306  0.517867  0.048485  0.137869
F2  0.186967  0.994318  0.520665  0.578790
F3  0.734819  0.541962  0.913154  0.807920
F4  0.402998  0.357224  0.952877  0.343632
F5  0.865100  0.830278  0.538161  0.922469

In [0]:
df[['C1','C2']]

          C1        C2
F1  0.685306  0.517867
F2  0.186967  0.994318
F3  0.734819  0.541962
F4  0.402998  0.357224
F5  0.865100  0.830278

In [0]:
df['C5'] = df['C3'] + df['C4']

In [0]:
df

          C1        C2        C3        C4        C5
F1  0.685306  0.517867  0.048485  0.137869  0.186354
F2  0.186967  0.994318  0.520665  0.578790  1.099455
F3  0.734819  0.541962  0.913154  0.807920  1.721074
F4  0.402998  0.357224  0.952877  0.343632  1.296508
F5  0.865100  0.830278  0.538161  0.922469  1.460631

In [0]:
#df.drop('C5')
#df.drop('C5',axis=1)
df.drop('C5',axis=1, inplace=True)

In [0]:
df

          C1        C2        C3        C4
F1  0.685306  0.517867  0.048485  0.137869
F2  0.186967  0.994318  0.520665  0.578790
F3  0.734819  0.541962  0.913154  0.807920
F4  0.402998  0.357224  0.952877  0.343632
F5  0.865100  0.830278  0.538161  0.922469

In [0]:
df.shape

(5, 4)

In [0]:
df.loc['F1']

C1    0.685306
C2    0.517867
C3    0.048485
C4    0.137869
Name: F1, dtype: float64

In [0]:
df.loc['F1':'F3']

          C1        C2        C3        C4
F1  0.685306  0.517867  0.048485  0.137869
F2  0.186967  0.994318  0.520665  0.578790
F3  0.734819  0.541962  0.913154  0.807920

In [0]:
df.iloc[1]

C1    0.186967
C2    0.994318
C3    0.520665
C4    0.578790
Name: F2, dtype: float64

In [0]:
df.iloc[2,2]

0.9131535576757686

In [24]:
df.iloc[:,:]

          C1        C2        C3        C4
F1  0.685306  0.517867  0.048485  0.137869
F2  0.186967  0.994318  0.520665  0.578790
F3  0.734819  0.541962  0.913154  0.807920
F4  0.402998  0.357224  0.952877  0.343632
F5  0.865100  0.830278  0.538161  0.922469

<h1><b>Condiciones

In [0]:
cond = df > 0.7

In [26]:
cond

       C1     C2     C3     C4
F1  False  False  False  False
F2  False   True  False  False
F3   True  False   True   True
F4  False  False   True  False
F5   True   True  False   True

In [27]:
df[df > 0.7]

          C1        C2        C3        C4
F1       NaN       NaN       NaN       NaN
F2       NaN  0.994318       NaN       NaN
F3  0.734819       NaN  0.913154  0.807920
F4       NaN       NaN  0.952877       NaN
F5  0.865100  0.830278       NaN  0.922469

In [29]:
df['C4']>0.7

F1    False
F2    False
F3     True
F4    False
F5     True
Name: C4, dtype: bool

In [32]:
df [ df['C4']>0.7 ]

          C1        C2        C3        C4
F3  0.734819  0.541962  0.913154  0.807920
F5  0.865100  0.830278  0.538161  0.922469

In [33]:
resultado = df [ df['C4']>0.7 ]
resultado

          C1        C2        C3        C4
F3  0.734819  0.541962  0.913154  0.807920
F5  0.865100  0.830278  0.538161  0.922469

<h1><b>Otros

In [0]:
d = { 'A': [1,2, np.nan], 'B': [4,np.nan,6], 'C': [7,8,9] }

In [0]:
df = pd.DataFrame(d)

In [36]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  6.0  9

In [37]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [38]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [40]:
df.fillna(value=10)

      A     B  C
0   1.0   4.0  7
1   2.0  10.0  8
2  10.0   6.0  9

<h1><b>Agrupando

In [0]:
data = {'Empresa': ['LG','LG','XIAOMI','XIAOMI'],
        'Vendedor': ['Harold','Tania','Jorge','Pablo'],
        'Ventas': [20,50,60,40]
        }

In [0]:
df = pd.DataFrame(data)

In [47]:
df

  Empresa Vendedor  Ventas
0      LG   Harold      20
1      LG    Tania      50
2  XIAOMI    Jorge      60
3  XIAOMI    Pablo      40